#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.backend_dev.module.users.null_resource.build: Refreshing state... [id=8969504958863078156]
module.backend_dev.module.users.null_resource.build (deposed object 287ac5e0): Refreshing state... [id=5551057093156250264]
module.backend_dev.module.users.null_resource.build (deposed object ae828622): Refreshing state... [id=9157790254186833433]
module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0]: Refreshing state... [id=fe8f65193259cbabeec5de4aef4055ba7903fc90]
module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0]: Refreshing state... [id=28ae988c4487c3b9b40da45f0d54eb2b53677310]
module.backend_dev.module.users.module.confirm_register_lambda.null_resource.archive[0]: Refreshing state... [id=1808405327067578015]
module.backend_dev.module.users.module.register_lambda.null_resource.archive[0]: Refreshing state... [id=4992005046997417120]
module.backend_dev.module.users.module.register_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_register]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=jasjcxj05f]
module.backend_dev.module.users.module.confirm_register_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_confirm_register]
module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=auth_confirm_register]
module.backend_dev.module.users.module.api_log_group.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=videoStreamer-dev]
module.backend_dev.module.users.module.register_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=auth_register]
module.backend_dev.module.users.aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_0kViXFLDP]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.backend_dev.module.users.aws_ssm_parameter.users_pool_id: Refreshing state... [id=/videoStreamer/dev/pool_id]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.backend_dev.module.users.aws_cognito_user_pool_client.client: Refreshing state... [id=2vnsahql5aq6qidnk4h2bcuei]
module.backend_dev.module.users.aws_ssm_parameter.users_client_id: Refreshing state... [id=/videoStreamer/dev/client_id]
module.frontend.aws_route53_record.ssl_verification["video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.ssl_verification["www.video.rayprogramming.com"]: Refreshing state... [id=Z0504674431EVA0LRLBF__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.backend_dev.module.users.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:529080338478:certificate/a5cac10b-e817-40dd-8599-f31ac3c934f2]
module.frontend.aws_s3_bucket_versioning.bucket_version: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=video.rayprogramming.com,private]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=video.rayprogramming.com]
module.backend_dev.module.users.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__d15789f6dfdbf2a94e5e29ee974e9637.auth.video.rayprogramming.com._CNAME]
module.backend_dev.module.users.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-24 03:38:21.657 +0000 UTC]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=auth.video.rayprogramming.com]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=lwge9o]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com_A]
module.frontend.aws_route53_record.subdomain_www: Refreshing state... [id=Z0504674431EVA0LRLBF_www.video.rayprogramming.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_stage.default[0] has changed
  ~ resource "aws_apigatewayv2_stage" "default" {
        id              = "$default"
        name            = "$default"
      + stage_variables = {}
        tags            = {
            "Name" = "videoStreamer-dev"
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::529080338478:role/auth_confirm_register" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-04-24T04:08:58Z" -> null
      - force_detach_policies = true -> null
      - id                    = "auth_confirm_register" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "auth_confirm_register" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "videoStreamer-dev"
        } -> null
      - tags_all              = {
          - "Name" = "videoStreamer-dev"
        } -> null
      - unique_id             = "AROAXWL5FJAXOH62J53DK" -> null

      - inline_policy {}
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/backend_dev.users/functions/dist/confirmRegistration.js",
                      - null,
                    ],
                ]
              - filename      = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.plan.json" -> null
      - id                   = "fe8f65193259cbabeec5de4aef4055ba7903fc90" -> null
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role.lambda[0] has been deleted
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::529080338478:role/auth_register" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-04-24T04:08:58Z" -> null
      - force_detach_policies = true -> null
      - id                    = "auth_register" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "auth_register" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "videoStreamer-dev"
        } -> null
      - tags_all              = {
          - "Name" = "videoStreamer-dev"
        } -> null
      - unique_id             = "AROAXWL5FJAXKMAUET3QX" -> null

      - inline_policy {}
    }

  # module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/backend_dev.users/functions/dist/register.js",
                      - null,
                    ],
                ]
              - filename      = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.plan.json" -> null
      - id                   = "28ae988c4487c3b9b40da45f0d54eb2b53677310" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.backend_dev.module.users.aws_cognito_user_pool_client.client will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "client" {
        id                                   = "2vnsahql5aq6qidnk4h2bcuei"
        name                                 = "videoStreamer_dev"
      ~ read_attributes                      = [
          - "phone_number_verified",
          + "phonenumber_verified",
            # (18 unchanged elements hidden)
        ]
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.backend_dev.module.users.aws_ssm_parameter.users_client_secret will be created
  + resource "aws_ssm_parameter" "users_client_secret" {
      + arn         = (known after apply)
      + data_type   = (known after apply)
      + description = "Cognito Client Secret for managing users"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/videoStreamer/dev/client_secret"
      + tags_all    = (known after apply)
      + tier        = "Standard"
      + type        = "SecureString"
      + value       = (sensitive value)
      + version     = (known after apply)
    }

  # module.backend_dev.module.users.null_resource.build must be replaced
+/- resource "null_resource" "build" {
      ~ id       = "8969504958863078156" -> (known after apply)
      ~ triggers = {
          - "always_run" = "2022-04-24T04:19:07Z"
        } -> (known after apply) # forces replacement
    }

  # module.backend_dev.module.users.null_resource.build (deposed object 287ac5e0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "build" {
      - id       = "5551057093156250264" -> null
      - triggers = {
          - "always_run" = "2022-04-24T04:08:36Z"
        } -> null
    }

  # module.backend_dev.module.users.null_resource.build (deposed object ae828622) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "build" {
      - id       = "9157790254186833433" -> null
      - triggers = {
          - "always_run" = "2022-04-24T04:00:38Z"
        } -> null
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "jasjcxj05f"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = "jasjcxj05f"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = (known after apply)
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = "jasjcxj05f"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /confirm"
      + target             = (known after apply)
    }

  # module.backend_dev.module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = "jasjcxj05f"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /register"
      + target             = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "2777561895" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/backend_dev.users/functions/dist/confirmRegistration.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.plan.json"
          - "filename"            = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.zip"
          - "timestamp"           = "1650773973195262000"
          - "was_missing"         = "true"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "auth_confirm_register-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all  = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_confirm_register"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all              = {
          + "Name" = "videoStreamer-dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "auth_confirm_register"
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Auth register confirm"
      + filename                       = (known after apply)
      + function_name                  = "auth_confirm_register"
      + handler                        = "confirmRegistration.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                       = {
          + "Name" = "videoStreamer-dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"     = "2vnsahql5aq6qidnk4h2bcuei"
              + "CLIENT_SECRET" = (sensitive)
              + "POOL_ID"       = "us-east-2_0kViXFLDP"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.confirm_register_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1808405327067578015" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/c5e63e0e441eaa87690ed4d7cf208f0e3ac94ce395be68e2be5a26777c692662.zip"
          - "timestamp" = "1650773973195262000"
        } -> (known after apply) # forces replacement
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "4227650822" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.backend_dev.module.users.module.register_lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/backend_dev.users/functions/dist/register.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.plan.json"
          - "filename"            = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.zip"
          - "timestamp"           = "1650773973198390000"
          - "was_missing"         = "true"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "auth_register-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all  = {
          + "Name" = "videoStreamer-dev"
        }
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "auth_register"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all              = {
          + "Name" = "videoStreamer-dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.backend_dev.module.users.module.register_lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "auth_register"
    }

  # module.backend_dev.module.users.module.register_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Auth register"
      + filename                       = (known after apply)
      + function_name                  = "auth_register"
      + handler                        = "register.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "videoStreamer-dev"
        }
      + tags_all                       = {
          + "Name" = "videoStreamer-dev"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLIENT_ID"     = "2vnsahql5aq6qidnk4h2bcuei"
              + "CLIENT_SECRET" = (sensitive)
              + "POOL_ID"       = "us-east-2_0kViXFLDP"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.backend_dev.module.users.module.register_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.backend_dev.module.users.module.register_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4992005046997417120" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/f9c0d7aaaaf7bcc0ea8037cd1e8af20296a231b4a66d9f10f3fce70c5c92560a.zip"
          - "timestamp" = "1650773973198390000"
        } -> (known after apply) # forces replacement
    }

Plan: 18 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*